turbq/atprog/packs/atmel/SAM4L_DFP/1.1.61/sam4l4/atdf/ATSAM4LS2C.atdf
        <module name="BPM" id="I7197" version="1.2.0">
          <instance name="BPM">
            <register-group name="BPM" name-in-module="BPM" address-space="base" offset="0x400F0000"/>
            <parameters>
              <param name="BKUPPMUX_MSB" value="9"/>
              <param name="BKUPWEN_AST" value="1"/>
              <param name="BKUPWEN_BOD18" value="4"/>
              <param name="BKUPWEN_BOD33" value="3"/>
              <param name="BKUPWEN_EIC" value="0"/>
              <param name="BKUPWEN_MSB" value="5"/>
              <param name="BKUPWEN_PICOUART" value="5"/>
              <param name="BKUPWEN_WDT" value="2"/>
              <param name="INSTANCE_ID" value="96"/>
            </parameters>
          </instance>
        </module>
        <module name="BSCIF" version="1.0.0">
          <instance name="BSCIF">
            <register-group name="BSCIF" name-in-module="BSCIF" address-space="base" offset="0x400F0400"/>
            <signals>
              <signal group="XIN32" function="XIN32" pad="XIN32"/>
              <signal group="XOUT32" function="XOUT32" pad="XOUT32"/>
            </signals>
            <parameters>
              <param name="BGBUF_NUM" value="6"/>
              <param name="BOD18_IMPLEMENTED" value="0"/>
              <param name="BOD33_IMPLEMENTED" value="0"/>
              <param name="BOD50_IMPLEMENTED" value="0"/>
              <param name="BR_NUM" value="4"/>
              <param name="BOD_OFF" value="0"/>
              <param name="BOD_ON" value="1"/>
              <param name="BOD_ON_NORESET" value="2"/>
              <param name="GC_DIV_CLOCK" value="1"/>
              <param name="GC_NO_DIV_CLOCK" value="0"/>
              <param name="INSTANCE_ID" value="97"/>
            </parameters>
          </instance>
        </module>
        <module name="CATB" id="I7567" version="1.0.0">
          <instance name="CATB">
            <register-group name="CATB" name-in-module="CATB" address-space="base" offset="0x40070000"/>
            <signals>
              <signal group="DIS" function="G" pad="PA02"/>
              <signal group="DIS" function="G" pad="PA12"/>
              <signal group="DIS" function="G" pad="PA23"/>
              <signal group="DIS" function="G" pad="PA31"/>
              <signal group="DIS" function="G" pad="PB03"/>
              <signal group="DIS" function="G" pad="PB12"/>
              <signal group="DIS" function="G" pad="PC05"/>
              <signal group="DIS" function="G" pad="PC14"/>
              <signal group="DIS" function="G" pad="PC23"/>
              <signal group="SENSE" index="0" function="G" pad="PA04"/>
              <signal group="SENSE" index="0" function="G" pad="PA27"/>
              <signal group="SENSE" index="0" function="G" pad="PB13"/>
              <signal group="SENSE" index="1" function="G" pad="PA05"/>
              <signal group="SENSE" index="1" function="G" pad="PA28"/>
              <signal group="SENSE" index="1" function="G" pad="PB14"/>
              <signal group="SENSE" index="2" function="G" pad="PA06"/>
              <signal group="SENSE" index="2" function="G" pad="PA29"/>
              <signal group="SENSE" index="2" function="G" pad="PB15"/>
              <signal group="SENSE" index="3" function="G" pad="PA07"/>
              <signal group="SENSE" index="3" function="G" pad="PA30"/>
              <signal group="SENSE" index="3" function="G" pad="PC00"/>
              <signal group="SENSE" index="4" function="G" pad="PA08"/>
              <signal group="SENSE" index="4" function="G" pad="PC01"/>
              <signal group="SENSE" index="5" function="G" pad="PA09"/>
              <signal group="SENSE" index="5" function="G" pad="PC02"/>
              <signal group="SENSE" index="6" function="G" pad="PA10"/>
              <signal group="SENSE" index="6" function="G" pad="PC03"/>
              <signal group="SENSE" index="7" function="G" pad="PA11"/>
              <signal group="SENSE" index="7" function="G" pad="PC04"/>
              <signal group="SENSE" index="8" function="G" pad="PA13"/>
              <signal group="SENSE" index="8" function="G" pad="PC06"/>
              <signal group="SENSE" index="9" function="G" pad="PA14"/>
              <signal group="SENSE" index="9" function="G" pad="PC07"/>
              <signal group="SENSE" index="10" function="G" pad="PA15"/>
              <signal group="SENSE" index="10" function="G" pad="PC08"/>
              <signal group="SENSE" index="11" function="G" pad="PA16"/>
              <signal group="SENSE" index="11" function="G" pad="PC09"/>
              <signal group="SENSE" index="12" function="G" pad="PA17"/>
              <signal group="SENSE" index="12" function="G" pad="PC10"/>
              <signal group="SENSE" index="13" function="G" pad="PA18"/>
              <signal group="SENSE" index="13" function="G" pad="PC11"/>
              <signal group="SENSE" index="14" function="G" pad="PA19"/>
              <signal group="SENSE" index="14" function="G" pad="PC12"/>
              <signal group="SENSE" index="15" function="G" pad="PA20"/>
              <signal group="SENSE" index="15" function="G" pad="PC13"/>
              <signal group="SENSE" index="16" function="G" pad="PA21"/>
              <signal group="SENSE" index="16" function="G" pad="PC15"/>
              <signal group="SENSE" index="17" function="G" pad="PA22"/>
              <signal group="SENSE" index="17" function="G" pad="PC16"/>
              <signal group="SENSE" index="18" function="G" pad="PA24"/>
              <signal group="SENSE" index="18" function="G" pad="PC17"/>
              <signal group="SENSE" index="19" function="G" pad="PA25"/>
              <signal group="SENSE" index="19" function="G" pad="PC18"/>
              <signal group="SENSE" index="20" function="G" pad="PA26"/>
              <signal group="SENSE" index="20" function="G" pad="PC19"/>
              <signal group="SENSE" index="21" function="G" pad="PB00"/>
              <signal group="SENSE" index="21" function="G" pad="PC20"/>
              <signal group="SENSE" index="22" function="G" pad="PB01"/>
              <signal group="SENSE" index="22" function="G" pad="PC21"/>
              <signal group="SENSE" index="23" function="G" pad="PB02"/>
              <signal group="SENSE" index="23" function="G" pad="PC22"/>
              <signal group="SENSE" index="24" function="G" pad="PB04"/>
              <signal group="SENSE" index="24" function="G" pad="PC24"/>
              <signal group="SENSE" index="25" function="G" pad="PB05"/>
              <signal group="SENSE" index="25" function="G" pad="PC25"/>
              <signal group="SENSE" index="26" function="G" pad="PB06"/>
              <signal group="SENSE" index="26" function="G" pad="PC26"/>
              <signal group="SENSE" index="27" function="G" pad="PB07"/>
              <signal group="SENSE" index="27" function="G" pad="PC27"/>
              <signal group="SENSE" index="28" function="G" pad="PB08"/>
              <signal group="SENSE" index="28" function="G" pad="PC28"/>
              <signal group="SENSE" index="29" function="G" pad="PB09"/>
              <signal group="SENSE" index="29" function="G" pad="PC29"/>
              <signal group="SENSE" index="30" function="G" pad="PB10"/>
              <signal group="SENSE" index="30" function="G" pad="PC30"/>
              <signal group="SENSE" index="31" function="G" pad="PB11"/>
              <signal group="SENSE" index="31" function="G" pad="PC31"/>
            </signals>
            <parameters>
              <param name="GCLK_NUM" value="3"/>
              <param name="PDCA_ID_RX" value="12"/>
              <param name="PDCA_ID_TX" value="30"/>
              <param name="SENSORS_MSB" value="31"/>
              <param name="STATUS_REG_NUMBER" value="1"/>
              <param name="INSTANCE_ID" value="19"/>
            </parameters>
          </instance>
        </module>
