turbq/atprog/packs/atmel/SAM4L_DFP/1.1.61/sam4l4/atdf/ATSAM4LS2C.atdf
        <register name="ICR" offset="0x10" rw="W" size="4" access-size="4" atomic-op="clear:ISR" initval="0x00000000" caption="Interrupt Clear Register">
          <bitfield name="OSC32RDY" caption="32kHz Oscillator Ready" mask="0x1"/>
          <bitfield name="RC32KRDY" caption="32kHz RC Oscillator Ready" mask="0x2"/>
          <bitfield name="RC32KLOCK" caption="32kHz RC Oscillator Lock" mask="0x4"/>
          <bitfield name="RC32KREFE" caption="32kHz RC Oscillator Reference Error" mask="0x8"/>
          <bitfield name="RC32KSAT" caption="32kHz RC Oscillator Saturation" mask="0x10"/>
          <bitfield name="BOD33DET" caption="BOD33 Detected" mask="0x20"/>
          <bitfield name="BOD18DET" caption="BOD18 Detected" mask="0x40"/>
          <bitfield name="BOD33SYNRDY" caption="BOD33 Synchronization Ready" mask="0x80"/>
          <bitfield name="BOD18SYNRDY" caption="BOD18 Synchronization Ready" mask="0x100"/>
          <bitfield name="SSWRDY" caption="VREG Stop Switching Ready" mask="0x200"/>
          <bitfield name="VREGOK" caption="Main VREG OK" mask="0x400"/>
          <bitfield name="LPBGRDY" caption="Low Power Bandgap Voltage Reference Ready" mask="0x1000"/>
          <bitfield name="AE" caption="Access Error" mask="0x80000000"/>
        </register>
        <register name="PCLKSR" offset="0x14" rw="R" size="4" access-size="4" initval="0x00000000" caption="Power and Clocks Status Register">
          <bitfield name="OSC32RDY" caption="32kHz Oscillator Ready" mask="0x1"/>
          <bitfield name="RC32KRDY" caption="32kHz RC Oscillator Ready" mask="0x2"/>
          <bitfield name="RC32KLOCK" caption="32kHz RC Oscillator Lock" mask="0x4"/>
          <bitfield name="RC32KREFE" caption="32kHz RC Oscillator Reference Error" mask="0x8"/>
          <bitfield name="RC32KSAT" caption="32kHz RC Oscillator Saturation" mask="0x10"/>
          <bitfield name="BOD33DET" caption="BOD33 Detected" mask="0x20"/>
          <bitfield name="BOD18DET" caption="BOD18 Detected" mask="0x40"/>
          <bitfield name="BOD33SYNRDY" caption="BOD33 Synchronization Ready" mask="0x80"/>
          <bitfield name="BOD18SYNRDY" caption="BOD18 Synchronization Ready" mask="0x100"/>
          <bitfield name="SSWRDY" caption="VREG Stop Switching Ready" mask="0x200"/>
          <bitfield name="VREGOK" caption="Main VREG OK" mask="0x400"/>
          <bitfield name="RC1MRDY" caption="RC 1MHz Oscillator Ready" mask="0x800"/>
          <bitfield name="LPBGRDY" caption="Low Power Bandgap Voltage Reference Ready" mask="0x1000"/>
        </register>
        <register name="UNLOCK" offset="0x18" rw="W" size="4" access-size="4" initval="0x00000000" caption="Unlock Register">
          <bitfield name="ADDR" caption="Unlock Address" mask="0x3FF"/>
          <bitfield name="KEY" caption="Unlock Key" mask="0xFF000000" values="BSCIF_UNLOCK__KEY"/>
        </register>
        <register name="CSCR" offset="0x1C" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Chip Specific Configuration Register">
        </register>
        <register name="OSCCTRL32" offset="0x20" rw="RW" size="4" access-size="4" initval="0x00000004" caption="Oscillator 32 Control Register">
          <bitfield name="OSC32EN" caption="32 KHz Oscillator Enable" mask="0x1"/>
          <bitfield name="PINSEL" caption="Pins Select" mask="0x2"/>
          <bitfield name="EN32K" caption="32 KHz output Enable" mask="0x4"/>
          <bitfield name="EN1K" caption="1 KHz output Enable" mask="0x8"/>
          <bitfield name="MODE" caption="Oscillator Mode" mask="0x700"/>
          <bitfield name="SELCURR" caption="Current selection" mask="0xF000"/>
          <bitfield name="STARTUP" caption="Oscillator Start-up Time" mask="0x70000"/>
        </register>
        <register name="RC32KCR" offset="0x24" rw="RW" size="4" access-size="4" initval="0x00000000" caption="32 kHz RC Oscillator Control Register">
          <bitfield name="EN" caption="Enable as Generic clock source" mask="0x1"/>
          <bitfield name="TCEN" caption="Temperature Compensation Enable" mask="0x2"/>
          <bitfield name="EN32K" caption="Enable 32 KHz output" mask="0x4"/>
          <bitfield name="EN1K" caption="Enable 1 kHz output" mask="0x8"/>
          <bitfield name="MODE" caption="Mode Selection" mask="0x10"/>
          <bitfield name="REF" caption="Reference select" mask="0x20"/>
          <bitfield name="FCD" caption="Flash calibration done" mask="0x80"/>
        </register>
        <register name="RC32KTUNE" offset="0x28" rw="RW" size="4" access-size="4" initval="0x00000000" caption="32kHz RC Oscillator Tuning Register">
          <bitfield name="FINE" caption="Fine value" mask="0x3F"/>
          <bitfield name="COARSE" caption="Coarse Value" mask="0x7F0000"/>
        </register>
        <register name="BOD33CTRL" offset="0x2C" rw="RW" size="4" access-size="4" caption="BOD33 Control Register">
          <bitfield name="EN" caption="Enable" mask="0x1"/>
          <bitfield name="HYST" caption="BOD Hysteresis" mask="0x2"/>
          <bitfield name="ACTION" caption="Action" mask="0x300"/>
          <bitfield name="MODE" caption="Operation modes" mask="0x10000"/>
          <bitfield name="FCD" caption="BOD Fuse Calibration Done" mask="0x40000000"/>
          <bitfield name="SFV" caption="BOD Control Register Store Final Value" mask="0x80000000"/>
        </register>
        <register name="BOD33LEVEL" offset="0x30" rw="RW" size="4" access-size="4" initval="0x00000000" caption="BOD33 Level Register">
          <bitfield name="VAL" caption="BOD Value" mask="0x3F"/>
        </register>
        <register name="BOD33SAMPLING" offset="0x34" rw="RW" size="4" access-size="4" initval="0x00000000" caption="BOD33 Sampling Control Register">
          <bitfield name="CEN" caption="Clock Enable" mask="0x1"/>
          <bitfield name="CSSEL" caption="Clock Source Select" mask="0x2"/>
          <bitfield name="PSEL" caption="Prescaler Select" mask="0xF00"/>
        </register>
        <register name="BOD18CTRL" offset="0x38" rw="RW" size="4" access-size="4" initval="0x00000000" caption="BOD18 Control Register">
          <bitfield name="EN" caption="Enable" mask="0x1"/>
          <bitfield name="HYST" caption="BOD Hysteresis" mask="0x2"/>
          <bitfield name="ACTION" caption="Action" mask="0x300"/>
          <bitfield name="MODE" caption="Operation modes" mask="0x10000"/>
          <bitfield name="FCD" caption="BOD Fuse Calibration Done" mask="0x40000000"/>
          <bitfield name="SFV" caption="BOD Control Register Store Final Value" mask="0x80000000"/>
        </register>
        <register name="BOD18LEVEL" offset="0x3C" rw="RW" size="4" access-size="4" initval="0x00000000" caption="BOD18 Level Register">
          <bitfield name="VAL" caption="BOD Value" mask="0x3F"/>
          <bitfield name="RANGE" caption="BOD Threshold Range" mask="0x80000000"/>
        </register>
        <register name="VREGCR" offset="0x44" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Voltage Regulator Configuration Register">
          <bitfield name="DIS" caption="Voltage Regulator disable" mask="0x1"/>
          <bitfield name="SSG" caption="Spread Spectrum Generator Enable" mask="0x100"/>
          <bitfield name="SSW" caption="Stop Switching" mask="0x200"/>
          <bitfield name="SSWEVT" caption="Stop Switching On Event Enable" mask="0x400"/>
          <bitfield name="SFV" caption="Store Final Value" mask="0x80000000"/>
        </register>
        <register name="VREGNCSR" offset="0x4C" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Normal Mode Control and Status Register">
        </register>
        <register name="VREGLPCSR" offset="0x50" rw="RW" size="4" access-size="4" initval="0x00000000" caption="LP Mode Control and Status Register">
        </register>
        <register name="RC1MCR" offset="0x58" rw="RW" size="4" access-size="4" initval="0x00000F00" caption="1MHz RC Clock Configuration Register">
          <bitfield name="CLKOE" caption="1MHz RC Osc Clock Output Enable" mask="0x1"/>
          <bitfield name="FCD" caption="Flash Calibration Done" mask="0x80"/>
          <bitfield name="CLKCAL" caption="1MHz RC Osc Calibration" mask="0x1F00"/>
        </register>
        <register name="BGCR" offset="0x5C" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bandgap Calibration Register">
        </register>
        <register name="BGCTRL" offset="0x60" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bandgap Control Register">
          <bitfield name="ADCISEL" caption="ADC Input Selection" mask="0x3" values="BSCIF_BGCTRL__ADCISEL"/>
          <bitfield name="TSEN" caption="Temperature Sensor Enable" mask="0x100"/>
        </register>
        <register name="BGSR" offset="0x64" rw="R" size="4" access-size="4" initval="0x00000000" caption="Bandgap Status Register">
          <bitfield name="BGBUFRDY" caption="Bandgap Buffer Ready" mask="0xFF" values="BSCIF_BGSR__BGBUFRDY"/>
          <bitfield name="BGRDY" caption="Bandgap Voltage Reference Ready" mask="0x10000"/>
          <bitfield name="LPBGRDY" caption="Low Power Bandgap Voltage Reference Ready" mask="0x20000"/>
          <bitfield name="VREF" caption="Voltage Reference Used by the System" mask="0xC0000"/>
        </register>
        <register name="BR" offset="0x78" rw="RW" size="4" access-size="4" count="4" initval="0x00000000" caption="Backup Register">
        </register>
        <register name="BRIFBVERSION" offset="0x3E4" rw="R" size="4" access-size="4" initval="0x00000100" caption="Backup Register Interface Version Register">
          <bitfield name="VERSION" caption="Version Number" mask="0xFFF"/>
          <bitfield name="VARIANT" caption="Variant Number" mask="0xF0000"/>
        </register>
        <register name="BGREFIFBVERSION" offset="0x3E8" rw="R" size="4" access-size="4" initval="0x00000110" caption="BGREFIFB Version Register">
          <bitfield name="VERSION" caption="Version Number" mask="0xFFF"/>
          <bitfield name="VARIANT" caption="Variant Number" mask="0xF0000"/>
        </register>
        <register name="VREGIFGVERSION" offset="0x3EC" rw="R" size="4" access-size="4" initval="0x00000110" caption="VREGIFA Version Register">
          <bitfield name="VERSION" caption="Version Number" mask="0xFFF"/>
          <bitfield name="VARIANT" caption="Variant Number" mask="0xF0000"/>
        </register>
