turbq/atprog/packs/atmel/SAM4L_DFP/1.1.61/sam4l4/atdf/ATSAM4LS2C.atdf
      <value-group name="EIC_IER__INT4">
        <value name="0" caption="No effect" value="0"/>
        <value name="1" caption="Enable Interrupt." value="1"/>
      </value-group>
      <value-group name="EIC_IDR__INT1">
        <value name="0" caption="No effect" value="0"/>
        <value name="1" caption="Disable Interrupt." value="1"/>
      </value-group>
      <value-group name="EIC_IDR__INT2">
        <value name="0" caption="No effect" value="0"/>
        <value name="1" caption="Disable Interrupt." value="1"/>
      </value-group>
      <value-group name="EIC_IDR__INT3">
        <value name="0" caption="No effect" value="0"/>
        <value name="1" caption="Disable Interrupt." value="1"/>
      </value-group>
      <value-group name="EIC_IDR__INT4">
        <value name="0" caption="No effect" value="0"/>
        <value name="1" caption="Disable Interrupt." value="1"/>
      </value-group>
      <value-group name="EIC_IMR__INT1">
        <value name="0" caption="Interrupt is disabled" value="0"/>
        <value name="1" caption="Interrupt is enabled." value="1"/>
      </value-group>
      <value-group name="EIC_IMR__INT2">
        <value name="0" caption="Interrupt is disabled" value="0"/>
        <value name="1" caption="Interrupt is enabled." value="1"/>
      </value-group>
      <value-group name="EIC_IMR__INT3">
        <value name="0" caption="Interrupt is disabled" value="0"/>
        <value name="1" caption="Interrupt is enabled." value="1"/>
      </value-group>
      <value-group name="EIC_IMR__INT4">
        <value name="0" caption="Interrupt is disabled" value="0"/>
        <value name="1" caption="Interrupt is enabled." value="1"/>
      </value-group>
      <value-group name="EIC_ISR__INT1">
        <value name="0" caption="An interrupt event has not occurred" value="0"/>
        <value name="1" caption="An interrupt event has occurred." value="1"/>
      </value-group>
      <value-group name="EIC_ISR__INT2">
        <value name="0" caption="An interrupt event has not occurred" value="0"/>
        <value name="1" caption="An interrupt event has occurred." value="1"/>
      </value-group>
      <value-group name="EIC_ISR__INT3">
        <value name="0" caption="An interrupt event has not occurred" value="0"/>
        <value name="1" caption="An interrupt event has occurred." value="1"/>
      </value-group>
      <value-group name="EIC_ISR__INT4">
        <value name="0" caption="An interrupt event has not occurred" value="0"/>
        <value name="1" caption="An interrupt event has occurred." value="1"/>
      </value-group>
      <value-group name="EIC_ICR__INT1">
        <value name="0" caption="No effect" value="0"/>
        <value name="1" caption="Clear Interrupt." value="1"/>
      </value-group>
      <value-group name="EIC_ICR__INT2">
        <value name="0" caption="No effect" value="0"/>
        <value name="1" caption="Clear Interrupt." value="1"/>
      </value-group>
      <value-group name="EIC_ICR__INT3">
        <value name="0" caption="No effect" value="0"/>
        <value name="1" caption="Clear Interrupt." value="1"/>
      </value-group>
      <value-group name="EIC_ICR__INT4">
        <value name="0" caption="No effect" value="0"/>
        <value name="1" caption="Clear Interrupt." value="1"/>
      </value-group>
      <value-group name="EIC_MODE__INT1">
        <value name="0" caption="Edge triggered interrupt" value="0"/>
        <value name="1" caption="Level triggered interrupt" value="1"/>
      </value-group>
      <value-group name="EIC_MODE__INT2">
        <value name="0" caption="Edge triggered interrupt" value="0"/>
        <value name="1" caption="Level triggered interrupt" value="1"/>
      </value-group>
      <value-group name="EIC_MODE__INT3">
        <value name="0" caption="Edge triggered interrupt" value="0"/>
        <value name="1" caption="Level triggered interrupt" value="1"/>
      </value-group>
      <value-group name="EIC_MODE__INT4">
        <value name="0" caption="Edge triggered interrupt" value="0"/>
        <value name="1" caption="Level triggered interrupt" value="1"/>
      </value-group>
      <value-group name="EIC_EDGE__INT1">
        <value name="0" caption="Triggers on falling edge" value="0"/>
        <value name="1" caption="Triggers on rising edge." value="1"/>
      </value-group>
      <value-group name="EIC_EDGE__INT2">
        <value name="0" caption="Triggers on falling edge" value="0"/>
        <value name="1" caption="Triggers on rising edge." value="1"/>
      </value-group>
      <value-group name="EIC_EDGE__INT3">
        <value name="0" caption="Triggers on falling edge" value="0"/>
        <value name="1" caption="Triggers on rising edge." value="1"/>
      </value-group>
      <value-group name="EIC_EDGE__INT4">
        <value name="0" caption="Triggers on falling edge" value="0"/>
        <value name="1" caption="Triggers on rising edge." value="1"/>
      </value-group>
    </module>
    <module name="FLASHCALW" id="I8322" version="1.1.0" caption="Flash Controller">
      <register-group name="FLASHCALW" caption="Flash Controller">
        <register name="FCR" offset="0x0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Flash Controller Control Register">
          <bitfield name="FRDY" caption="Flash Ready Interrupt Enable" mask="0x1" values="FLASHCALW_FCR__FRDY"/>
          <bitfield name="LOCKE" caption="Lock Error Interrupt Enable" mask="0x4" values="FLASHCALW_FCR__LOCKE"/>
          <bitfield name="PROGE" caption="Programming Error Interrupt Enable" mask="0x8" values="FLASHCALW_FCR__PROGE"/>
          <bitfield name="FWS" caption="Flash Wait State" mask="0x40" values="FLASHCALW_FCR__FWS"/>
          <bitfield name="WS1OPT" caption="Wait State 1 Optimization" mask="0x80"/>
        </register>
        <register name="FCMD" offset="0x4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Flash Controller Command Register">
          <bitfield name="CMD" caption="Command" mask="0x3F" values="FLASHCALW_FCMD__CMD"/>
          <bitfield name="PAGEN" caption="Page number" mask="0xFFFF00"/>
          <bitfield name="KEY" caption="Write protection key" mask="0xFF000000" values="FLASHCALW_FCMD__KEY"/>
        </register>
